app/Controllers/Carrito_Controller.php

SELECT *
FROM `ventas`
---
    public function misVentas(){

        $ventasModel = new Ventas_Model();

        //$ventas['ventas'] = $ventasModel->select("*")->join("usuarios", "usuarios.id = ventas.id_usuarioC")->findAll();

        //$ventas2= $ventasModel->join ("usuarios", "usuarios.id = ventas.id_usuarioC");



        $ventas = array('ventas' => $ventasModel->findAll());